// ConsoleApplication7.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{ //найти регекс в плюсах
	import re 
pattern = r"a[0-9]{2}[a-z]55661"
pattern1 = r"a[a-z][0-9]{2}55661"
pattern2 = r"a[0-9][a-z][0-9]55661"
Siegesmund_tickets = input()
s = input()
answer = re.findall(pattern, s)
answer.extend(re.findall(pattern1, s))
answer.extend(re.findall(pattern2, s))
print(' '.join(answer) if answer != [] else -1)
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
